; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 960562 1 1 2 4 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	thermograph0 - mode
	thermograph1 - mode
	Star1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star0 - direction
	Star4 - direction
	Phenomenon5 - direction
	Star6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
)
(:goal (and
	(pointing satellite0 Star1)
	(have_image Star4 thermograph1)
	(have_image Phenomenon5 thermograph0)
	(have_image Star6 thermograph0)
	(have_image Planet7 thermograph1)
	(have_image Phenomenon8 thermograph1)
	(have_image Star9 thermograph0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
2. (turn_to satellite0 star0 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star0)
   goals met: 0 of 7
3. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 0 of 7
4. (turn_to satellite0 star9 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star9)
   goals met: 0 of 7
5. (take_image satellite0 star9 instrument0 thermograph0)
   added: (have_image star9 thermograph0)
   goals met: 1 of 7
6. (turn_to satellite0 star4 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star4)
   goals met: 1 of 7
7. (take_image satellite0 star4 instrument0 thermograph1)
   added: (have_image star4 thermograph1)
   goals met: 2 of 7
8. (turn_to satellite0 star1 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star1)
   goals met: 3 of 7
9. (turn_to satellite0 planet7 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet7)
   goals met: 2 of 7
10. (take_image satellite0 planet7 instrument0 thermograph1)
   added: (have_image planet7 thermograph1)
   goals met: 3 of 7
11. (turn_to satellite0 star1 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star1)
   goals met: 4 of 7
12. (turn_to satellite0 phenomenon8 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon8)
   goals met: 3 of 7
13. (take_image satellite0 phenomenon8 instrument0 thermograph1)
   added: (have_image phenomenon8 thermograph1)
   goals met: 4 of 7
14. (turn_to satellite0 star1 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 star1)
   goals met: 5 of 7
15. (turn_to satellite0 phenomenon5 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon5)
   goals met: 4 of 7
16. (take_image satellite0 phenomenon5 instrument0 thermograph0)
   added: (have_image phenomenon5 thermograph0)
   goals met: 5 of 7
17. (turn_to satellite0 star1 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star1)
   goals met: 6 of 7
18. (turn_to satellite0 star6 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star6)
   goals met: 5 of 7
19. (take_image satellite0 star6 instrument0 thermograph0)
   added: (have_image star6 thermograph0)
   goals met: 6 of 7
20. (turn_to satellite0 star1 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star1)
   goals met: 7 of 7
